#Знайти суму всіх елементів масиву дійсних чисел, більших за задане
#число. Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами
#від 50 до 100.
#Павлюк Владислав
#Знайти добуток всіх елементів масиву цілих чисел, менших 0. Розмірність
#масиву - 10. Заповнення масиву здійснити за допомогою клавіатури.
#Дудук Вадим
import numpy as np
import random
while True:
    x=int(input('Введіть число для порівняння:'))
    b=np.zeros(20,dtype=float)
    count=0
    for i in range(20):
      b[i] = random.uniform(50,100)
    print(b)
    for k in range(20):
      if b[k]>x: 
         count+=l
    if count==0:
         print('Таких чисел не існує')
    else:
         print('Сума елементів',count)
    result = input('Продовжити? Так - 1, Ні - інше: ')
    if result == '1':
        continue
    else:
        break
